import { YearPeriod, ChronologyField } from './types';

export const MOCK_DATA: YearPeriod[] = [
  {
    field: ChronologyField.Cinema,
    yearStart: 1990,
    yearEnd: 1999,
    events: [
      {
        year: 1990,
        description:
          'Значимость этих проблем настолько очевидна, что постоянный количественный рост и сфера нашей активности создаёт предпосылки качественно новых шагов для позиций',
      },
      {
        year: 1992,
        description:
          'Задача организации, в особенности же реализация намеченного плана развития требует определения и уточнения дальнейших направлений развития проекта',
      },
      {
        year: 1995,
        description:
          'Задача организации, в особенности же курс на социально-ориентированный национальный проект обеспечивает актуальность направлений прогрессивного развития',
      },
      {
        year: 1998,
        description:
          'Разнообразный и богатый опыт социально-экономическое развитие позволяет выполнить важнейшие задания по разработке позиций, занимаемых участниками в отношении поставленных задач',
      },
      {
        year: 1999,
        description:
          'Значимость этих проблем настолько очевидна, что курс на социально-ориентированный национальный проект напрямую зависит от экономической целесообразности принимаемых решений',
      },
    ],
  },
  {
    field: ChronologyField.Music,
    yearStart: 2002,
    yearEnd: 2005,
    events: [
      {
        year: 2002,
        description:
          'Повседневная практика показывает, что повышение уровня гражданского сознания напрямую зависит от новых предложений',
      },
      {
        year: 2003,
        description:
          'С другой стороны постоянное информационно-техническое обеспечение нашей деятельности в значительной степени обуславливает создание системы масштабного изменения ряда параметров',
      },
      {
        year: 2005,
        description:
          'Дорогие друзья, курс на социально-ориентированный национальный проект представляет собой интересный эксперимент проверки соответствующих условий активизации',
      },
    ],
  },
  {
    field: ChronologyField.Literature,
    yearStart: 2007,
    yearEnd: 2009,
    events: [
      {
        year: 2007,
        description:
          'Таким образом, консультация с профессионалами из IT в значительной степени обуславливает создание системы масштабного изменения ряда параметров',
      },
      {
        year: 2008,
        description:
          'Повседневная практика показывает, что сложившаяся структура организации позволяет оценить значение существующих финансовых и административных условий',
      },
      {
        year: 2009,
        description:
          'Разнообразный и богатый опыт реализация намеченного плана развития играет важную роль в формировании системы обучения кадров, соответствующей насущным потребностям',
      },
    ],
  },
  {
    field: ChronologyField.Sport,
    yearStart: 2010,
    yearEnd: 2012,
    events: [
      {
        year: 2010,
        description:
          'Соображения высшего порядка, а также выбранный нами инновационный путь требует от нас анализа дальнейших направлений развития проекта',
      },
      {
        year: 2011,
        description:
          'Практический опыт показывает, что постоянное информационно-техническое обеспечение нашей деятельности позволяет выполнить важнейшие задания по разработке модели развития?',
      },
    ],
  },
  {
    field: ChronologyField.Technology,
    yearStart: 2012,
    yearEnd: 2014,
    events: [
      {
        year: 2012,
        description:
          'Задача организации, в особенности же выбранный нами инновационный путь представляет собой интересный эксперимент проверки модели развития',
      },
      {
        year: 2013,
        description:
          'Разнообразный и богатый опыт реализация намеченного плана развития требует от нас системного анализа системы обучения кадров, соответствующей насущным потребностям',
      },
      {
        year: 2014,
        description:
          'Повседневная практика показывает, что консультация с профессионалами из IT напрямую зависит от новых предложений',
      },
    ],
  },
  {
    field: ChronologyField.Science,
    yearStart: 2015,
    yearEnd: 2022,
    events: [
      {
        year: 2015,
        description:
          '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        year: 2016,
        description:
          'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
      },
      {
        year: 2017,
        description:
          'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      },
      {
        year: 2020,
        description:
          'Равным образом начало повседневной работы по формированию позиции в значительной степени обуславливает создание дальнейших направлений развитая системы массового участия',
      },
      {
        year: 2021,
        description:
          'Повседневная практика показывает, что начало повседневной работы по формированию позиции обеспечивает актуальность направлений прогрессивного развития',
      },
      {
        year: 2022,
        description:
          'Практический опыт показывает, что социально-экономическое развитие позволяет выполнить важнейшие задания по разработке модели развития',
      },
    ],
  },
];
